{
    "model_config": {
        "name": "model_1",
        "layers": [
            {
                "name": "input1_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        5
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input1_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "input2_input",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        7
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input2_input"
                },
                "inbound_nodes": []
            },
            {
                "name": "input1",
                "class_name": "Dense",
                "config": {
                    "name": "input1",
                    "trainable": true,
                    "units": 4,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input1_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "input2",
                "class_name": "Dense",
                "config": {
                    "name": "input2",
                    "trainable": true,
                    "units": 4,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input2_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_1",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "input2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "activation_1",
                "class_name": "Activation",
                "config": {
                    "name": "activation_1",
                    "trainable": true,
                    "activation": "sigmoid"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "output1",
                "class_name": "Dense",
                "config": {
                    "name": "output1",
                    "trainable": true,
                    "units": 3,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "output2",
                "class_name": "Dense",
                "config": {
                    "name": "output2",
                    "trainable": true,
                    "units": 4,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_1",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_1",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAUAAABTAAAAcyAAAAB0AGoBdABqAnwAZAFkAo0CdABqA3wAgwFkARkAgwJT\nACkDTukBAAAAKQHaBGF4aXMpBNoBS9oHb25lX2hvdNoGYXJnbWF42glpbnRfc2hhcGUpAdoBeKkA\ncggAAAD6WC9ob21lL2RhcnJlbi5zYXJnZW50L3NyYy9jb2duaXphbnQvcGxhdGZvcm0vYXNjZW5k\nLWF1dG9zZWcvYXNjZW5kYXV0b3NlZy9jcmVhdGVfbW9kZWwucHnaCDxsYW1iZGE+SwAAAHMCAAAA\nEAE=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": [
                        3
                    ],
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "output1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "lambda_2",
                "class_name": "Lambda",
                "config": {
                    "name": "lambda_2",
                    "trainable": true,
                    "function": [
                        "4wEAAAAAAAAAAQAAAAUAAABTAAAAcyAAAAB0AGoBdABqAnwAZAFkAo0CdABqA3wAgwFkARkAgwJT\nACkDTukBAAAAKQHaBGF4aXMpBNoBS9oHb25lX2hvdNoGYXJnbWF42glpbnRfc2hhcGUpAdoBeKkA\ncggAAAD6WC9ob21lL2RhcnJlbi5zYXJnZW50L3NyYy9jb2duaXphbnQvcGxhdGZvcm0vYXNjZW5k\nLWF1dG9zZWcvYXNjZW5kYXV0b3NlZy9jcmVhdGVfbW9kZWwucHnaCDxsYW1iZGE+SwAAAHMCAAAA\nEAE=\n",
                        null,
                        null
                    ],
                    "function_type": "lambda",
                    "output_shape": [
                        4
                    ],
                    "output_shape_type": "raw",
                    "arguments": {}
                },
                "inbound_nodes": [
                    [
                        [
                            "output2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input1_input",
                0,
                0
            ],
            [
                "input2_input",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "lambda_1",
                0,
                0
            ],
            [
                "lambda_2",
                0,
                0
            ]
        ]
    },
    "model_weights": {
        "input1": [
            [
                [
                    0.0512654185295105,
                    -0.7831546068191528,
                    -0.4157675504684448,
                    -0.018902793526649475
                ],
                [
                    0.1334405094385147,
                    -0.5763633847236633,
                    0.5972071290016174,
                    -0.15661996603012085
                ],
                [
                    0.6633223295211792,
                    0.8142586946487427,
                    -0.06816517561674118,
                    0.05447773262858391
                ],
                [
                    0.7229422926902771,
                    0.2037937045097351,
                    -0.17724303901195526,
                    0.7979655861854553
                ],
                [
                    -0.1859389990568161,
                    0.7741600275039673,
                    -0.26083904504776,
                    0.47367972135543823
                ]
            ],
            [
                0.0,
                0.0,
                0.0,
                0.0
            ]
        ],
        "input2": [
            [
                [
                    0.09402451664209366,
                    -0.37495294213294983,
                    -0.713613748550415,
                    -0.07455118745565414
                ],
                [
                    -0.44526004791259766,
                    0.3652709424495697,
                    -0.2429026961326599,
                    0.6793225407600403
                ],
                [
                    0.019884878769516945,
                    0.48773783445358276,
                    0.25902673602104187,
                    -0.36943066120147705
                ],
                [
                    0.28939926624298096,
                    0.4719938337802887,
                    -0.07559136301279068,
                    0.16487666964530945
                ],
                [
                    0.18321095407009125,
                    -0.4221223294734955,
                    0.35216423869132996,
                    -0.17479978501796722
                ],
                [
                    0.09386313706636429,
                    -0.40621352195739746,
                    -0.10872099548578262,
                    -0.24537228047847748
                ],
                [
                    0.11630457639694214,
                    -0.03479781001806259,
                    -0.3678602874279022,
                    -0.16971619427204132
                ]
            ],
            [
                0.0,
                0.0,
                0.0,
                0.0
            ]
        ],
        "output1": [
            [
                [
                    -0.7186471223831177,
                    -0.24242113530635834,
                    -0.4573986828327179
                ],
                [
                    0.620854914188385,
                    -0.17767372727394104,
                    0.8426981568336487
                ],
                [
                    0.8432480692863464,
                    -0.8012492060661316,
                    -0.014783463440835476
                ],
                [
                    0.8232942819595337,
                    0.27014264464378357,
                    -0.7295934557914734
                ]
            ],
            [
                0.0,
                0.0,
                0.0
            ]
        ],
        "output2": [
            [
                [
                    -0.3450525104999542,
                    -0.34292417764663696,
                    -0.7342234253883362,
                    0.3171803951263428
                ],
                [
                    0.35575011372566223,
                    -0.22513671219348907,
                    -0.7192246317863464,
                    -0.22426073253154755
                ],
                [
                    0.8558886051177979,
                    -0.23306648433208466,
                    -0.35043251514434814,
                    -0.8212954998016357
                ],
                [
                    -0.3089171350002289,
                    -0.8421034812927246,
                    0.5985102653503418,
                    -0.4884684681892395
                ]
            ],
            [
                0.0,
                0.0,
                0.0,
                0.0
            ]
        ]
    }
}
